[
  {
    "id": "5fd7f8b80f500c8e56cf00b8",
    "firstName": "Patti",
    "lastName": "Jannetta",
    "occupation": "Musician",
    "yearInducted": "2020",
    "inducteeContentList": [
      {
        "textContent": [
          {
            "id": "60370cd2cf34005dc1d20cc0",
            "itemLabel": 0,
            "contentDescription": "Full Steam Ahead.That’s the name of the first band Patti Jannetta sang in. It could also be the byword for a stupefyingly diversified four-decade career that’s seen Patti go from being a teen singing sensation in the touring production of Jesus Christ Superstar in Las Vegas – where Elvis, Gladys Knight and Wayne Cochrane worked across the hall – to Juno-nominated dance/pop starlet; recording artist; opening act for a world tour by Manee, Thailand’s “Madonna”; in-demand session and touring singer; MC for eight New Year’s Eve concerts at Nathan Phillips Square; co-author and co-singer with Bo Diddley on a movie soundtrack and oh so much more. Patti has somehow morphed into a community institution in Mississauga and Toronto where she’s become a sort of Fairy Godmother of the musical, fundraising, fun side of charitable causes.A Fairy Godmother who doesn’t wave a wand, but rolls up her sleeves and pitches projects, organizes festivals, writes grants, sources funds, accelerates permits, calls friends in high places and gets the job done no matter what it takes to get the job done. The Mississauga Waterfront Festival, The Mississauga Canoe Club, Canadian Music Week, The Canadian Association for the Advancement of Music and the Arts,The Sick Kids Herbie Fund, Toronto’s Vocal Arts Festival, Italfest, Big Music Fest, The Mississauga Music Walk of Fame. They have one thing in common: Patti’s applied her generous spirit, organizational gifts, networking expertise, and wit and charm in front of a microphone and in the corporate office to deliver good things for good causes. Usually with a great beat and a loving lyric and that great voice: the one with the big smile in it.Since she sat sipping her Shirley Temple as a 7-year-old at an Imperial Room rehearsal and told her father that he really ought to get a new pair of stockings for that poor singer –– Josephine Baker ––  Patti Jannetta was destined for show business.That’s what happens when dear old Dad is the maitre d’ at the Imperial Room and acts as chauffeur and billet for the likes of Tony Bennett and Vic Damone. Pearl Bailey visits the cottage. When you lunch with Dad, you meet Tina Turner or Cher.One minute she was singing in a musical at Vincent Massey Secondary School. The next she was in the Canadian production of Jesus Christ Superstar with Victor Garber, then whisked off from the CNE to Las Vegas.When one of Garber’s friends needed a lead singer in a Motown band. Patti joined up. Three weeks later, the bass player broke his thumb and this new guy named Dave Baker joined the band and changed her life.They formed their own band shortly thereafter, got married and have called Mississauga home since 1976. When the girls came along, someone had to put a pause on show biz. That’s how Dave’s purchasing career began.  “He knew music was such a part of me I couldn’t give it up,” says Patti.Steve Thomson was a guitarist in a band called Fat Chance which used to play on the same circuit as Full Steam Ahead. He was so good at promoting and running shows that he became a promoter himself and 40 years later his BackStage Productions still thrives. And so does his friendship and admiration for Patti. “She was fearless and could do anything,” he says, citing her last-minute appearance in 1984 at the Sopot Music Festival in Poland. The Polish consulate even opened after hours to issue her a special visa. She learned to sing a song in Polish during the overseas flight. Patti not only won over the audience but ended up duetting with headliner Charles Aznavour and winning the festival’s “musicians’ favourite” award.“One of her biggest talents is that she has heart and people can see that,” says Thomson, who has worked with Patti innumerable times –  often with another client and Mississauga Music Walk of Fame member – Ronnie Hawkins. “It’s a tough, tough business and she’s not a quitter.” Patti has put together innumerable events where the Patti Jannetta Band and the Patti Jannetta brand are synonymous. That brand is anchored in professional execution and solid delivery fronted by a grin we all know so well and a personality that puts everyone at immediate ease.A company she co-owns that helps charities fundraise through live performances is called Music Makes Miracles. It might more accurately be described as Patti Makes Miracles. She’s won scads of awards for her efforts during the years from the Mississauga Arts Council Patron of the Arts Award named in honour of her friend Laurie Pallett to an “Artist and Builder” Canadian Recording Legacy Award to last year’s Brilliant-Minded Woman Award. Home has always been special to her.Whether it was the first Canada Day celebration in the city at Saddington Park, Hazel McCallion galas, albums at Metalworks, putting together a video for the Herbie Fund of her co-written song Healing Hearts, Changing Lives, or bringing her father’s memoirs to life in a retro-supper club show at the Living Arts Centre, Patti Jannetta is a Mississauga loyalist.She was an enthusiastic founding committee member of the Music Walk of Fame because, like founder Jim Tovey, she wanted to shine a spotlight on the wealth of local musicians, builders and creators whose worthy careers often went unrecognized.Jim always joked that Patti was the first one who should be inducted every year, although the rules forbade committee members from inclusion.  He knew the committee couldn’t afford to lose her because she had indispensable connections to both the performing and corporate sides of the music business and to the larger community that knows and trusts her.Not long ago, Patti received the bad news that she’s been taken off the committee.That is, of course, for good reason.You can pick a category – musician, founder, creator, builder – and Patti meets all the criteria.Now it’s time for Patti to join her many musical friends in the spot where we know she’s belonged since its beginning – a place of honour on the Mississauga Music Walk of Fame."
          }
        ]
      },
      {
        "videoContent": [
          {
            "id": "60370e16cf34005dc1d20cc2",
            "itemLabel": 3,
            "pathName": "https://www.youtube.com/watch?v=e3ui5N0s8Og",
            "contentDescription": "Somewhere Over The Rainbow by Patti Jannetta with John Ebata on Keyboards, Danny Turco on Guitar, Aaron Ferrera on Drums and Dave Baker on Bass. Video by Sanborg Productions."
          }
        ]
      }
    ]
  },
  {
    "id": "5fd7fab60f500c8e56cf00b9",
    "firstName": "Phil X",
    "lastName": "",
    "occupation": "Musician",
    "yearInducted": "2019",
    "inducteeContentList": []
  },
  {
    "id": "5fd7fb060f500c8e56cf00ba",
    "firstName": "Prakash",
    "lastName": "Josh",
    "occupation": "Musician",
    "yearInducted": "2019",
    "inducteeContentList": []
  }
]
